Tekla Open API Reference for Tekla Structures 2025
Vector.Dot Method
Overload List
Name | Description
Dot(Vector)
 Returns a dot product of the current vector and the given vector.
Dot(Vector, Vector)
 Returns a dot product of the given two vectors.
Top
See Also
Reference
Vector Class
Tekla.Structures.Geometry3d Namespace